"""Створити міні блог програму. Тобто запускаючи програму,
користувачі можуть перечитувати статті.
В програмі користувач може мати одну з таких ролей: EDITOR, VISITOR, ADMIN.
Якщо користувач має роль VISITOR, то він може тільки читати статті.
Якщо він має роль EDITOR, то він може додавати і читати статті.
Якщо користувач ADMIN, то він може робити все, що йому заманеться.
В програмі повинен бути як мінімум один декоратор, замикання.
Розбити програму на модулі. Наприклад можна створити модуль actions,
де будуть розміщені функції, які наприклад створюватимуть статті,
чи показуватимуть їх. Можна створити модуль auth,
в якому визначатиметься роль користувача під час запуску програми.
Можна створити модуль utils, в якому будуть якісь допоміжні функції,
що використовуватимуться в декількох модулях.
"""
from auth import get_login, get_name, get_roles
from actions import to_do_something


def main():
    names = get_name()
    roles = get_roles()
    access = get_login(names, roles)
    to_do_something()



if __name__ == '__main__':
    main()